namespace Task3Students.StudentsFunc;

public class FileGenerator : IGeneratingFileGenerator
{
    private List<Student> _source =
    [
        new("Петров", "Дмитрий", "МГУ", "Мехмат", 1, "Математический", 1, "Москва", 18),
        new("Теплов", "Андрей", "СПГУ", "Мехмат", 1, "Механический", 2, "Петербург", 23),
        new("Гавасяв", "Емеля", "МГУ", "Инженерный", 3, "Математический", 1, "Москва", 22),
        new("Юров", "Вася", "МГУ", "Логический", 3, "Математический", 2, "Владивосток", 21),
        new("Берендеев", "Сергей", "СПУ", "Логический", 4, "Математический", 1, "Петербург", 18),
        new("Жуликов", "Алексей", "МГУ", "Мехмат", 4, "Механический", 3, "Петербург", 25),
        new("Иванов", "Андрей", "МГУ", "Инженерный", 5, "Механический", 1, "Москва", 24),
        new("Логинов", "Михаил", "МГУ", "Инженерный", 5, "Механический", 4, "Москва", 19),
        new("Андреева", "Андрия", "МГУ", "Инженерный", 6, "Механический", 2, "Москва", 44),
        new("Пужев", "Степан", "МГУ", "Мехмат", 6, "Биологический", 5, "Владивосток", 21),
        new("Жуков", "Иван", "МГУ", "Мехмат", 6, "Гуманитарный", 4, "Владивосток", 22),
        new("Лужков", "Дмитрий", "МГУ", "Мехмат", 2, "Математический", 1, "Москва", 19),
        new("Варьянов", "Андрей", "СПГУ", "Мехмат", 2, "Механический", 2, "Петербург", 23),
        new("Восресеньев", "Федя", "ПГУ", "Мехмат", 1, "Механический", 3, "Пенза", 23),
        new("Филосов", "Фил", "МГУ", "Инженерный", 1, "Механический", 1, "Владивосток", 43)
    ];

    protected IFile File = new FileAdapter();

    protected FileGenerator() { }

    public static IGeneratingFileGenerator Create()
    {
        return new FileGenerator();
    }

    public void GenerateCsvFile(string path)
    {
        var lines = new List<string>();
        foreach (var student in _source)
        {
            lines.Add(student);
        }
        File.WriteAllLines(path, lines.ToArray());
    }
}